Week 4/Day 4/timetracking/app/views/people/show.html.erb

<ul>
  <% @person.projects.each do |project| %>
---
SELECT "projects".* FROM "projects" INNER JOIN "participations" ON "projects"."id" = "participations"."project_id" WHERE "participations"."person_id" = ?  [["person_id", 1]]