Week 4/Day 4/timetracking/app/controllers/entries_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @project = Project.find params[:project_id]

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 7]]
---
  def new
    @project = Project.find params[:project_id]

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "entries".* FROM "entries" WHERE "entries"."project_id" = ? AND "entries"."id" = ? LIMIT 1  [["project_id", 7], ["id", 1]]
---
  def edit
    @project = Project.find params[:project_id]
    @entry = @project.entries.find params[:id]

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "entries" ("hours", "minutes", "date", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["hours", 12], ["minutes", 42], ["date", "2016-02-03 00:00:00.000000"], ["project_id", 5], ["created_at", "2016-02-03 12:01:37.007481"], ["updated_at", "2016-02-03 12:01:37.007481"]]
---
  def create
    @project = Project.find params[:project_id]
    @entry = @project.entries.new entry_params

    if @entry.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "entries".* FROM "entries" WHERE "entries"."project_id" = ? AND "entries"."id" = ? LIMIT 1  [["project_id", 5], ["id", 5]]
UPDATE "entries" SET "hours" = ?, "minutes" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["hours", 6], ["minutes", 59], ["updated_at", "2016-02-03 16:01:14.557259"], ["id", 5]]
---
  def update
    @project = Project.find params[:project_id]
    @entry = @project.entries.find params[:id]

    if @entry.update_attributes entry_params

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 8]]
SELECT  "entries".* FROM "entries" WHERE "entries"."project_id" = ? AND "entries"."id" = ? LIMIT 1  [["project_id", 8], ["id", 18]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 18]]
---
  def destroy
    @project = Project.find params[:project_id]
    @entry = @project.entries.find params[:id]
    @entry.destroy