Week 4/Day 4/timetracking/app/controllers/people_controller.rb

  def show
    @person = Person.find params[:id]
    @available_projects = Project.all - @person.projects
---
SELECT "projects".* FROM "projects" INNER JOIN "participations" ON "projects"."id" = "participations"."project_id" WHERE "participations"."person_id" = ?  [["person_id", 1]]

  def associate_project
    @person = Person.find params[:id]
    @project = Project.find params[:project_id]
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 5]]