Week 4/Day 2/timetracking/app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @project = Project.find params[:id]